package lab.lab03.p1;
/*
TODO:
    1.设计一个三角形类，有如下约束：
        a.) 三角形只能有三条边；
        b.) 可根据三条边构造普通三角形对象， 或者根据腰和底构造等腰三角形，
        或者只输入一条边，构造等边三角形；
        c.) 三角形提供四项服务：
            计算周长、计算面积、 修改三条边的值、输出三条边的信息。
            注：面积计算的海伦公式为：
                Math.sqrt(p*(p-a)*(p-b)*(p-c))，
            其中 p 是半周长，a/b/c 是边,Math.sqrt()是开平方函数。
        d.) 设计直角三角形(即 Rt 三角)。
            直角三角拥有普通三角的全部服务，并有特色：
            可以根据三条边构造对象，
            也可以根据两条直角边，斜边自动算出构造对象。
            输出直角三角形的相关信息。
 */
public class App {
}
