#include <stdio.h>
#include <stdlib.h>

#define M 8  // 使用宏定义常量
#define N 8

int main() {
    int mg[M+2][N+2] = {  
        {1,1,1,1,1,1,1,1,1,1},
        {1,0,0,1,0,0,0,1,0,1},
        {1,0,0,1,0,0,0,1,0,1},
        {1,0,0,0,0,1,1,0,0,1},
        {1,0,1,1,1,0,0,0,0,1},
        {1,0,0,0,1,0,0,0,0,1},
        {1,0,1,0,0,0,1,0,0,1},
        {1,0,1,1,1,0,1,1,0,1},
        {1,1,0,0,0,0,0,0,0,1},
        {1,1,1,1,1,1,1,1,1,1}
    };
    /*题目没有明说，功能我就设定在这个特定的迷宫里，第一行输入起点坐标，第二行输入终点坐标，判断该小球是否可以到达终点并输出路线*/
    return 0;
}